USE StudentBaseSmall;


Полный список экзаменов, упорядоченный по дате, названию курса, группе, фамилии, имени (vCour_Exam_Stud_Group_1)

Списки групп - 
общий, (vGroup_Stud_2)
со студентами (vGroup_Stud_1)
и без студентов (vGroup_Stud_3)

Списки студентов - 
общий, (vStud_Group_1)
в группах (vStud_Group_2)
и без групп(vStud_Group_3)

Списки студентов - сдававших и не сдававших экзамены (vExam_Stud_1)

Список студентов со средней оценкой выше 9 (отличники)(vExam_Stud_2)
Список студентов со всеми оценками выше 6 (успевающие) (vExam_Stud_3)
Список студентов с хотя бы одной оценкой ниже 6 (неуспевающие) (vExam_Stud_4)

Список курсов, упорядоченных по средней оценке и названию (vCours_Exam_1)
Список курсов, где все студенты получили оценки не ниже 6 (vCours_Exam_2)
Список групп, где все студенты получили оценки не ниже 6 (vGrop_Exam_Stud_1)
Список курсов, где все студенты получили оценки выше 10 (vCourse_Exam_4)
Список групп, где все студенты получили оценки выше 10 (vGroup_Exam_Stud_2)


Курсы - минимальная, максимальная, средняя оценки, cуммарная оплата, к-во экзаменов (vCours_Exam_3)

Студенты - минимальная, максимальная, средняя оценки, cуммарная оплата, к-во экзаменов (vStud_Exam_1)

Группы - минимальная, максимальная, средняя оценки, cуммарная оплата (vGroup_Exam_Stud_3)

Группы, курсы - минимальная, максимальная, средняя оценки, cуммарная оплата, к-во экзаменов (Group_Cours_Stud_Exam_1)


